# pn(0) = 1
# pn(n) = 0 (n < 0)
# pn(n) = pn(n-1) + p(n-2) - pn(n-5) - pn(n-7) + pn(n-12) + p(n-15) - pn(n-22) - ...
# ここでpn(n-k)のkは一般語価格数全体を渡り、符号は++--を繰り返す


limit = 100000
penta = []
1.step do |n|
  a = n*(3*n-1)/2
  break if a > limit
  penta.push(a)
  a = (-n)*(3*(-n)-1)/2
  break if a > limit
  penta.push(a)
end

pn = [1]
1.upto(limit) do |n|
  pn[n] = 0
  penta.zip([1,1,-1,-1].cycle).each do |k,sign|
    break if n-k < 0
    pn[n] += sign * pn[n-k]
  end
  if pn[n] % 1_000_000 == 0
    p n,pn[n]
    exit
  end
end
#=> 55374
# => 36325300925435785930832331577396761646715836173633893227071086460709268608053489541731404543537668438991170680745272159154493740615385823202158167635276250554555342115855424598920159035413044811245082197335097953570911884252410730174907784762924663654000000