73126890
key = "319 680 180 690 129 620 762 689 762 318 368 710 720 710 629 168 160 689 716 731 736 729 316 729 729 710 769 290 719 680 318 389 162 289 162 718 729 319 790 680 890 362 319 760 316 729 380 319 728 716".split(" ")

key = key.uniq.sort
["129", "160", "162", "168", "180", "289", "290", "316", "318", "319", "362", "368",
    "380", "389", "620", "629", "680", "689", "690", "710", "716", "718", "719", "720", "728", "729", "731", "736", "760", "762", "769", "790", "890"]

# キーの1文字目、2文字目、3文字目
key.map(&:chars).transpose.map{|ary| ary.uniq.sort.join}
["123678", "123689", "012689"]
# ここで両端の数字が7と0だとわかる
/7.*0/

# キーから7と0の情報を削除する
key2 = key.map{|item| item.delete("7").delete("0")}.filter{|item| item.size != 1}
["129", "16", "162", "168", "18", "289", "29", "316", "318", "319", "362", "368", "38", "389", "62", "629", "68", "689", "69", "16", "18", "19", "28", "29", "31", "36", "62", "69", "89"]
# キーの1文字目、末尾
key2.map{|item| [item[0],item[-1]]}.transpose.map{|item| item.uniq.sort.join}
=> ["12368", "12689"]
# ここで次の両端の数字が3と9だとわかる
/73.*90/

# キーから3と9の情報を削除する
key3 = key2.map{|item| item.delete("3").delete("9")}.filter{|item| item.size != 1}
=> ["12", "16", "162", "168", "18", "28", "16", "18", "62", "68", "62", "62", "68", "68", "16", "18", "28", "62"]
# キーの1文字目、末尾
key3.map{|item| [item[0],item[-1]]}.transpose.map{|item| item.uniq.sort.join}
=> ["126", "268"]
# ここで次の両端の数字が1と8だとわかる
/731.*890/
# 使ってない数字は2と6。キーの中に762がある。
# ここまできたらもうわかる
73162890
