# m<=nとおいていい
# 立てかける横
# mxn
# 3x2の長方形の場合
#  6+4+2
# +3+2+1
# =18
# 1x1=1
# 1x2=3
# 2x2=9
# 1x3=3
# 2x3=6+4+2+3+2+1
#    =(2+1)(3+2+1)
#    =18
# 3x3=9+6+3+6+4+2+3+2+1=36
#    = (3+2+1)(3+2+1)
# うん

def s(n)
  n*(n+1)/2
end

def s_rev(n)
  (Math.sqrt(2*n+0.25) - 0.5).floor
end

def f(n,m)
  s(n)*s(m)  
end

#f(n,m)が2_000_000にちかくなるようなn,mを求めよ

f(1,1999) #=> 1999000
f(1,2000) #=> 2001000
f(2,1155) #=> 2002770
f(2,1154) #=> 1999305
f(52,52)  #=> 1898884
f(53,53)  #=> 2047761
# 1から53まで総当たれば行けそうだ
1.upto(53)

owatta