
k=1: 1 = 1 = 1
k=2: 4 = 2 × 2 = 2 + 2
k=3: 6 = 1 × 2 × 3 = 1 + 2 + 3
k=4: 8 = 1 × 1 × 2 × 4 = 1 + 1 + 2 + 4
k=5: 8 = 1 × 1 × 2 × 2 × 2 = 1 + 1 + 2 + 2 + 2
k=6: 12 = 1 × 1 × 1 × 1 × 2 × 6 = 1 + 1 + 1 + 1 + 2 + 6
k=8: 16 = 1 × 1 × 1 × 1 × 1 × 1 × 2 × 8 = 1 + 1 + 1 + 1 + 1 + 1 + 2 + 8

k=1: 1 = 1 = 1
k=2: 4 = 2 × 2 = 2 + 2
k=3: 6 = 2 × 3 > 2 + 3
k=4: 8 = 2 × 4 > 2 + 4
k=5: 8 = 2 × 2 × 2 > 2 + 2 + 2
k=6: 12 = 2 × 6 > 2 + 6



12を因数分解する
2*2*3

うーん
最小積和数を小さくしつつ、項数を増やすコツは1を足しまくること
例えば全ての項を1とすると最小積和数は必ずkより大きくなる
kに対してスタート地点は
1 × 1 × ... × k < 1 + 1 + ... + k
k < 2k-1
ここで1を一つ2に変えると
2k = 2k 成立
つまり最小積和数はkから2kの間に必ず存在